# RbsInsulationThicknessForDuct Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsInsulationThicknessForDuct Property
ParameterTypeId Class See Also
---
"Insulation Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsInsulationThicknessForDuct { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsInsulationThicknessForDuct As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsInsulationThicknessForDuct {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace